// src/data/FamousData.ts
export interface FamousFigure {
    id: number;
    name: string;
    image: string;
    description: string;
    // Add more fields as needed
    lifespan?: string;
    achievements?: string[];
  }
  
  export const famousFigures: FamousFigure[] = [
    { 
      id: 1, 
      name: "Чингис хаан", 
      image: "/images/genghis_khan.jpg", 
      description: "Чингис хаан (1162-1227) нь Монголын эзэнт гүрнийг үндэслэгч, алдарт цэргийн жанжин байв. Тэрээр нэгдсэн Монгол улсыг байгуулж, дэлхийн түүхэнд хамгийн том эзэнт гүрнүүдийн нэг болгосон.",
      lifespan: "1162-1227",
      achievements: [
        "Монголын эзэнт гүрнийг үндэслэгч",
        "Нэгдсэн Монгол улсыг байгуулсан",
        "Дэлхийн хамгийн том эзэнт гүрнийг бүтээсэн"
      ]
    },
    { 
      id: 2, 
      name: "Өгөдэй хаан", 
      image: "/images/ogodei.jpg", 
      description: "Өгэдэй хаан (1186-1241) нь Чингис хааны гурав дахь хүү бөгөөд Монголын эзэнт гүрний хоёр дахь их хаан юм. Тэрээр эцгийнхээ үндэслэсэн гүрнийг улам тэлж, захиргааны тогтолцоог боловсронгуй болгосон.",
      lifespan: "1186-1241",
      achievements: [
        "Хархорум хотыг байгуулсан",
        "Монголын эзэнт гүрнийг өргөжүүлсэн",
        "Захиргааны тогтолцоог боловсронгуй болгосон"
      ]
    },
    { 
        id: 3, 
        name: "Хубилай хаан", 
        image: "/images/khubilai.jpg", 
        description: "Хубилай хаан (1215-1294) нь Чингис хааны ач хүү бөгөөд Юань гүрнийг үндэслэгч. Тэрээр Хятадыг эзлэн төвлөрсөн засаглалыг бий болгож, Марко Полод зочилсон алдарт хаан юм." ,
        lifespan: "1186-1241",
      achievements: [
        "Хархорум хотыг байгуулсан",
        "Монголын эзэнт гүрнийг өргөжүүлсэн",
        "Захиргааны тогтолцоог боловсронгуй болгосон"
      ]
    },
      { 
        id: 4, 
        name: "Мандухай сэцэн хатан", 
        image: "/images/mandukhai.jpg", 
        description: "Мандухай сэцэн хатан (1448-1510) нь Монголын алдарт эмэгтэй жанжин, удирдагч. Тэрээр Даян хааныг хамгаалж, Монголыг дахин нэгтгэхэд гол үүрэг гүйцэтгэсэн." ,
        lifespan: "1186-1241",
      achievements: [
        "Хархорум хотыг байгуулсан",
        "Монголын эзэнт гүрнийг өргөжүүлсэн",
        "Захиргааны тогтолцоог боловсронгуй болгосон"
      ]
      },
      { 
        id: 5, 
        name: "Занабазар", 
        image: "/images/Zanabazar.jpg", 
        description: "Занабазар (1635-1723) нь Монголын буддын шашны тэргүүн, урлагын алдарт мастер. Тэрээр Соёмбо бичгийг зохиож, буддын урлагийн гайхамшигт бүтээлүүдийг үлдээсэн." ,
        lifespan: "1186-1241",
      achievements: [
        "Хархорум хотыг байгуулсан",
        "Монголын эзэнт гүрнийг өргөжүүлсэн",
        "Захиргааны тогтолцоог боловсронгуй болгосон"
      ]
      }
  ];