
export const timelineData = [
  // Huns period
  {
    year: -209,
    event: "Хүннү гүрэн байгуулагдсан.",
  },
  {
    year: -53,
    event: "Хүннү гүрний ноён Чингис хаан шиг хүчтэй удирдагч болох Аттила их хаан мандаж, Европ руу довтлов.",
  },
  // Mongol Empire era
  {
    year: 1206,
    event: "Чингис хаан Монголын эзэнт гүрнийг байгуулсан.",
  },
  {
    year: 1227,
    event: "Чингис хаан нас барж, Өгөдэй хаан ширээнд суув.",
  },
  {
    year: 1241,
    event: "Монголчууд Европт их довтолгоо хийв.",
  },
  {
    year: 1271,
    event: "Хубилай хаан Юань гүрнийг байгуулсан.",
  },
  {
    year: 1368,
    event: "Юань гүрэн унаж, Монголчууд нутаг буцсан.",
  },
  // 16th-18th Century
  {
    year: 1550,
    event: "Монгол улс 16-р зууны үед дахин нэгтгэгдэж, Монголын аймагт Далай ламийн удирдлага эхэлсэн.",
  },
  {
    year: 1691,
    event: "Цахар хааны түрэмгийлэл Монголын газар нутгийг улам бүр хязгаарласан.",
  },
  {
    year: 1720,
    event: "Монгол Улс Манж Чин гүрний нутагт орсон.",
  },
  // 20th Century
  {
    year: 1911,
    event: "Монгол улс Манж Чин гүрнээс салж, тусгаар тогтносон.",
  },
  {
    year: 1921,
    event: "Монгол Ардын хувьсгал болж, ардын засгийн газар байгуулагдсан.",
  },
  {
    year: 1924,
    event: "Монголын Бүгд Найрамдах Улс байгуулагдлаа.",
  },
  {
    year: 1939,
    event: "Монгол Улс Японы довтолгооноос хамгаалсан Халх голын тулаан болсон.",
  },
  // Modern Mongolia
  {
    year: 1990,
    event: "Монгол улс Ардчилсан хувьсгал хийж, олон намын системийг бий болгосон.",
  },
  {
    year: 1992,
    event: "Монголын шинэ Үндсэн хуулиа баталсан.",
  },
  {
    year: 2008,
    event: "Монгол улсын эдийн засаг өсөлттэй болж, уул уурхай, хөдөө аж ахуй зэрэг салбарууд хүчтэй хөгжсөн.",
  },
  {
    year: 2021,
    event: "Монгол Улс COVID-19 цар тахлын хязгаарлалтад орсон.",
  },
  {
    year: 2025,
    event: "Монгол Улс дэлхийн эдийн засгийн хөгжилд шинэ дэвшил, өрсөлдөх чадвартай хөгжиж байна.",
  },
];
